
![KYKMS](./Docs/Pics/logo_keyi.png "科亿文档知识库管理系统")

科亿知识库 KY KMS
===============
当前最新版本： V0.1.1（发布日期：202208308）

项目介绍：
-----------------------------------

<h3 align="center">面向常用文档的知识库管理系统</h3>

科亿知识库 KY KMS 既是一款知识库，同时也是一款易于上手的文档管理工具！

在信息化时代，我们日常工作中产生大量的文档。我们积累下来的文档，是一笔巨大的财富，但文档越多，我们在其中找到我们所需要文档的时间成本越高。

我们面对大量的文档一筹莫展，就好像面前座立着一金山，但我们却不知道如何开采金子。

`科亿知识库宗旨是:` 文档简单整理，知识创造价值


适用项目
-----------------------------------
科亿知识库，可以应用在任何需要进行常用文档整理、分类、归集、检索的地方，尤其适合知识密集型单位/历史文档丰富的单位。

交流互动
-----------------------------------
- 官方站点 ：  [http://www.kykms.cn](http://www.kykms.cn)
- 在线演示 ：  [http://test.kykms.cn](http://test.kykms.cn) 账号：admin/123456
- QQ ： 22247537
- Mail : hnliuwx#tom.com
- github: [https://github.com/mahonelau/kykms](https://github.com/mahonelau/kykms)
- gitee: [https://gitee.com/kyxxjs/km_community](https://gitee.com/kyxxjs/km_community)
- 微信 ： 如果你有任何产品上的想法、意见或建议，或商务上的合作需求，请扫码添加我们微信进一步沟通：

![微信](./Docs/Pics/wechat.jpg)

版权声明
-----------------------------------
开源不代表免费，科亿遵循 GPL-3.0 开源协议发布，并提供技术交流学习，但 绝不允许修改后和衍生的代码做为闭源的商业软件发布和销售 ！ 如果需要将本产品在本地进行任何附带商业化性质行为使用， 请联系项目负责人进行商业授权 ，以遵守 GPL 协议保证您的正常使用。 
目前在国内 GPL 协议具备合同特征，是一种民事法律行为 ，属于我国《合同法》调整的范围。科亿项目团队保留一切诉讼权利。 科亿开源团队拥有对本开源协议的最终解释权。


为什么选择KY KMS?
-----------------------------------
科亿知识库基于强大的Elasticsearch检索引擎技术构建，检索能力强大，支持最全面的检索特性，同时检索性能卓越，可以无限可能的集群扩展，支持高达百亿级别的记录数量。
在关系数据库方面支持mysql与oracle，更多的数据库支持在开发中。
![KY KMS](./Docs/Pics/advantage_kms.png)
![KY KMS](./Docs/Pics/process.png)

